# 1.  Напишіть програму, яка пропонує користувачу ввести ціле число
#  і визначає чи це число парне чи непарне,
#  чи введені дані коректні.

# try:
#     a=int(input("Введіть ваше число:"))
#     if a%2==0:
#         print("Парне число")
#     if a%2==1:
#         print("Непарне число")
#     if a==0:
#         print("Ви ввели ноль")
# except(ZeroDivisionError, NameError, KeyboardInterrupt, ValueError ): 
# 	print("Упс")


# 2.  Напишіть програму, яка пропонує користувачу ввести свій вік,
#  після чого виводить повідомлення про те чи вік є парним чи непарним числом.
#  Необхідно передбачити можливість введення від’ємного числа,
#  в цьому випадку згенерувати власну виняткову ситуацію.
#  Головний код має викликати функцію, яка обробляє введену інформацію.

# while True:
#     try:
#         age=int(input("Введіть ваш вік"))
#         if age<0:
#             raise ValueError("Ви ввели від'ємне число")
#         if age%2==0:
#             print("Парне число")
#         if age%2==1:
#             print("Непарне число")
#         if age==0:
#             print("Ви ще не народились:)")
#     except(ValueError):
#         print("Упс, щось не так")

# 3.  Напишіть програму для обчислення частки двох чисел, які вводяться користувачем послідовно через кому,
#  передбачити випадок ділення на нуль, випадки синтаксичних помилок та випадки інших виняткових ситуацій.
#  Використати блоки else та finaly.

# while True:
#     try:
#         a=[]
#         for i in range(2):
#             a.append(int(input("Введіть ваше число: ")))
#         print(a[0]/a[1])
#     except(ValueError):
#         print("Упс, введіть число, а не букви")
#     except(ZeroDivisionError):
#         print("Упс, ви ввели ноль")

# 4.  Написати  програму, яка аналізує введене число та в залежності від числа видає день тижня,
#  який відповідає цьому числу (1 це Понеділок, 2 це Вівторок і т.д.) .
#  Врахувати випадки введення чисел від 8 і більше,
#  а також випадки введення не числових даних.

class CustomError(Exception): 
    def __init__(self, data): 
        self.data = data
    def __str__(self):
        return repr(self.data)

        
while True:
    try:
        day=int(input("Введіть ваше число: "))
        days={1:"Понеділок", 2:"Вівторок", 3:"Середа", 4:"Четвер", 5:"Пятниця", 6:"Субота", 7:"Неділя, йди до церкви:)"}
        if day<=7 and day>=1:
            print(days.get(day))
        elif day>7:
            raise CustomError("Ваш номер не може бути більше 7")
        elif day<1:
            raise CustomError("Ваш номер не може бути менше 1")
    except(ValueError):
         print("Упс, введіть числа")
    except CustomError as e:
        print("Помилка:", e.data) 