#Роздрукувати всі парні числа менші 100 (написати два варіанти коду: один використовуючи цикл while, а інший з використанням циклу for).
#n=0
#while n<100:
#    if n%2==0:
#        n+=2
#       print(n, end=',')

#for n in range(0,100,2):
#    print(n, end=',')

#Роздрукувати всі непарні числа менші 100. (написати два варіанти коду: один використовуючи оператор continue, а інший без цього оператора).
#for n in range(100):
#    if n%2==0:
#       continue
#   print(n, end=',')

#print(list(range(1,100,2)))

#3.  Перевірити чи список містить непарні числа.(Підказка: використати оператор break)

#list_of_numbers=[1,2,3,4,5,6,7,]
#for n in list_of_numbers:
#    if n%2==1:
#        print('В списку є непарні числа')
#        break
#    else:
#        print('В списку немає непарних чисел')

#4.  Створити список, який містить елементи цілочисельного типу, потім за допомогою циклу перебору змінити тип даних елементів на числа з плаваючою крапкою. (Підказка: використати вбудовану функцію float ()).

#list_of_numbers=[1,2,3,4,5,6,7,8,9,10]
#for n in list_of_numbers:
#   print(float(n), end=',')

#5.  Вивести числа Фібоначі включно до введеного числа n, використовуючи цикли. (Послідовність чисел Фібоначі 0, 1, 1, 2, 3, 5, 8, 13 і т.д.)

#n=int(input())
#a=0
#b=1
#print(a,end=',')
#print(b,end=',')
#while a<n:
#    a=a+b
#    b=a+b
#    print(a, end=',')
#    print(b, end=',')
#    if b>n:
#        break

#6.  Створити список, що складається з чотирьох елементів типу string. Потім, за допомогою циклу for, вивести елементи по черзі на екран.

#some_list=['cat','dog','and me']
#for i in some_list:
#    print(i, end=' ')

#7.  Змінити попередню програму так, щоб в кінці кожної букви елементів при виводі додавався певний символ, наприклад “#”. (Підказка: цикл for може бути вкладений в інший цикл, а також  треба використати функцію print(“ ”, end=”%”)).

#some_list=['cat','dog','and me']
#for i in some_list:
#    print(i, end=' ^._.^,')

#8.  Юзер вводить число з клавіатури, написати скріпт, який визначає чи це число просте чи складне.

number=int(input('Введіть будь ласка число:' ))
if number>1 and number%2==0 and number!=2 or number%3==0 and number!=3:
    print('Складне число')
else:
    print('Просте число')